package dev.kdam.khmerformat.enums;

/**
 * ខែសេស (មិគសិរ មាឃ ចេត្រ ជេស្ឋ ស្រាពណ៍ និងអស្សុជ) មានតែ២៩ថ្ងៃ ឯខែគូ (បុស្ស ផល្គុន ពិសាខ អាសាឍ ភទ្របទ និងកត្តិក) មាន៣០ថ្ងៃ ។
 * ខែសេសមាន២៩ថ្ងៃ គិតជាម៉ោងខ្វះ១២ម៉ោងក្នុង១ខែ ។
 * ខែគូមាន៣០ថ្ងៃ គិតជាម៉ោងលើស១២ម៉ោងក្នុង១ខែ ។
 * ១ឆ្នាំតាមចន្ទគតិមានចំនួន ៣៥៤ថ្ងៃ ឯសុរិយគតិមានចំនួន ៣៦៥ថ្ងៃ គឺតិចជាងសុរិយគតិ១១ថ្ងៃក្នុង១ឆ្នាំ។ នៅពេលគ្រប់៣ឆ្នាំ ខាងចន្ទគតិក៏សន្សំថ្ងៃបាន ៣៣ថ្ងៃ ។
 * នៅឆ្នាំដែលមាន៣៣ថ្ងៃនោះឯងទើបត្រូវបន្ថែមមួយខែទៀតត្រង់ខែអាសាឍ គឺ បឋមាសាឍមាន៣០ថ្ងៃ និង ទុតិយាសាឍមាន៣០ថ្ងៃ ។
 */
public class LunarMonth {
    public static String[] month = { "មិគសិរ", "បុស្ស", "មាឃ", "ផល្គុន", "ចេត្រ", "ពិសាខ", "ជេស្ឋ", "អាសាឍ", "ស្រាពណ៍", "ភទ្របទ", "អស្សុជ", "កត្ដិក" };
    public static String[] leapYearMonth = { "មិគសិរ", "បុស្ស", "មាឃ", "ផល្គុន", "ចេត្រ", "ពិសាខ", "ជេស្ឋ","បឋមាសាឍ", "ទុតិយាសាឍ", "ស្រាពណ៍", "ភទ្របទ", "អស្សុជ", "កត្ដិក" };
}
